{
    "title": "Enabling end-to-end secure federated learning in biomedical research on heterogeneous computing environments with APPFLx",
    "authors": [
        "Trung-Hieu Hoang",
        "Jordan Fuhrman",
        "Marcus Klarqvist",
        "Miao Li",
        "Pranshu Chaturvedi",
        "Zilinghan Li",
        "Kibaek Kim",
        "Minseok Ryu",
        "Ryan Chard",
        "E.A. Huerta",
        "Maryellen Giger",
        "Ravi Madduri"
    ],
    "venue": "Computational and Structural Biotechnology Journal",
    "tldr": "Facilitating large-scale, cross-institutional collaboration in biomedical machine learning (ML) projects requires a trustworthy and resilient federated learning (FL) environment to ensure that sensitive information such as protected health information is kept confidential. Specifically designed for this purpose, this work introduces APPFLx - a low-code, easy-to-use FL framework that enables easy setup, configuration, and running of FL experiments. APPFLx removes administrative boundaries of research organizations and healthcare systems while providing secure end-to-end communication, privacy-preserving functionality, and identity management. Furthermore, it is completely agnostic to the underlying computational infrastructure of participating clients, allowing an instantaneous deployment of this framework into existing computing infrastructures. Experimentally, the utility of APPFLx is demonstrated in two case studies: (1) predicting participant age from electrocardiogram (ECG) waveforms, and (2) detecting COVID-19 disease from chest radiographs. Here, ML models were securely trained across heterogeneous computing resources, including a combination of on-premise high-performance computing and cloud computing facilities. By securely unlocking data from multiple sources for training without directly sharing it, these FL models enhance generalizability and performance compared to centralized training models while ensuring data remains protected. In conclusion, APPFLx demonstrated itself as an easy-to-use framework for accelerating biomedical studies across organizations and healthcare systems on large datasets while maintaining the protection of private medical data.",
    "paper": "publications/hoang2023enabling.pdf",
    "bibtex": "hoang2023enabling",
    "website": "https://www.csbj.org/article/S2001-0370(24)00423-9/fulltext",
    "poster": null,
    "slides": null,
    "publisher": null,
    "year": 2024,
    "month": 12,
    "selected": false,
    "category": "fl"
}

